app/controllers/api/books_controller.rb

SELECT  `books`.* FROM `books` WHERE `books`.`user_id` = ? LIMIT 1  [["user_id", 1]]
SELECT  `books`.* FROM `books`  ORDER BY `books`.`id` ASC LIMIT 1
---
  def index
    @books = Book.where(:user_id => params[:user_id], :is_sold => false)
    arr = []
    @books.each do |book|