app/controllers/api/users_controller.rb

  def index
    @users = User.find_by_email(params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = ? LIMIT 1  [["email", "luvsaxenabornwotin@gmail.com"]]